# Summary of Notebook
    Full Set: 21
    Exported as pickle & saved as depart_transformed
    Transfomed the original dataframe from wide to long and cleaned up index
    Memory: kept it as it was
    Datatype: kept it as object
    Null: department_id 21 has department name as 'missing'
    Duplicates: no duplicates
    Column notes:  department_id 21 has missing department name

In [2]:
#importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import datetime as dt

In [3]:
#import csv customers dataframe
df_depart = pd.read_csv(r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis\02 Data\Original Data\departments.csv')
path = r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis'
df_depart = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'))

In [4]:
#getting to know the dataframe
df_depart.shape

(1, 22)

In [5]:
#seeing the type of data and columns
df_depart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   department_id  1 non-null      object
 1   1              1 non-null      object
 2   2              1 non-null      object
 3   3              1 non-null      object
 4   4              1 non-null      object
 5   5              1 non-null      object
 6   6              1 non-null      object
 7   7              1 non-null      object
 8   8              1 non-null      object
 9   9              1 non-null      object
 10  10             1 non-null      object
 11  11             1 non-null      object
 12  12             1 non-null      object
 13  13             1 non-null      object
 14  14             1 non-null      object
 15  15             1 non-null      object
 16  16             1 non-null      object
 17  17             1 non-null      object
 18  18             1 non-null      object
 19  19             1 non-null      object
 20  20             1 non-null      object
 21  21             1 non-null      object
dtypes: object(22)
memory usage: 304.0+ bytes

In [6]:
#seeing the columns and data
df_depart.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [10]:
#not an easy way to see the information: transposing the dataframe
df_depart.T

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [11]:
#renaming the new dataframe
df_depart_t = df_depart.T

In [12]:
df_depart_t.head()

                        0
department_id  department
1                  frozen
2                   other
3                  bakery
4                 produce

In [13]:
#seeing the end of the columns and data
df_depart_t.tail()

            0
17  household
18     babies
19     snacks
20       deli
21    missing

In [14]:
#because the new database does not have an index - there was just a 0 as a header in the transposed
df_depart_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [15]:
 #getting rid of the 0 header by creating a new header and remember row 0 = 1st row
new_header = df_depart_t.iloc[0]

In [16]:
#checking to see the new output after changing the rule for the new header
new_header

0    department
Name: department_id, dtype: object

In [17]:
 #create a new dataframe that only copies over rows beyond the first row
df_depart_t_new = df_depart_t[1:]

In [18]:
 #now sets the new header for the database
df_depart_t_new.columns = new_header

In [19]:
#checking that the updated database is correct
df_depart_t_new.head()

department_id department
1                 frozen
2                  other
3                 bakery
4                produce
5                alcohol

In [20]:
df_depart_t_new.tail()

department_id department
17             household
18                babies
19                snacks
20                  deli
21               missing

In [21]:
#seeing info again
df_depart_t_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 1 to 21
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   department  21 non-null     object
dtypes: object(1)
memory usage: 336.0+ bytes

In [22]:
#changing datatype to reduce memory - changing objects to category
df_depart_t_new['department'] = df_depart_t_new['department'].astype('category')

C:\Users\Selena\AppData\Local\Temp/ipykernel_22644/3391824851.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_depart_t_new['department'] = df_depart_t_new['department'].astype('category')

In [26]:
#changing datatype to reduce memory - changing objects to category
df_depart_t_new['department'] = df_depart_t_new['department'].astype('object')

C:\Users\Selena\AppData\Local\Temp/ipykernel_22644/3521400589.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_depart_t_new['department'] = df_depart_t_new['department'].astype('object')

In [27]:
#checking dataframe
df_depart_t_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 1 to 21
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   department  21 non-null     object
dtypes: object(1)
memory usage: 336.0+ bytes

# Notes on memory change:  kept it as it was

In [24]:
#seeing if any data is missing
df_depart_t_new.isnull().sum()

department_id
department    0
dtype: int64

# Notes on null findings: nothing is null

In [25]:
#looking for duplicates
(df_depart_t_new.duplicated().value_counts())

False    21
dtype: int64

# Notes on duplicates: no duplicates

In [28]:
#exporting the file as a pickle
df_depart_t_new.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'depart_transformed.pkl'))